obosob/mangpages/en_GX/man8/fsck.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\" " fo' hilit19
.TH FSCK 8 "July 1996" "util-linux" "System Administration"
.SH NAME
fsck.minix \- check consistency of Minix filesystem
.SH SYNOPSIS
.B fsck.minix
.RB [ \-larvsmf ]
.I device
.SH DESCRIPTION
.B fsck.minix
performs a cold-ass lil consistency check fo' tha Linux MINIX filesystem.  Da current
version supports tha 14 characta n' 30 characta filename options.

Da program
assumes tha filesystem is quiescent.
.B fsck.minix
should not be used on a mounted thang unless you can be shizzle no muthafucka is
writin ta it (and remember dat tha kernel can write ta it when it
searches fo' files).

Da \fIdevice\fR name will probably have tha followin form:
.nf
.RS
/dev/hda[1\(en63] (IDE disk 1)
/dev/hdb[1\(en63] (IDE disk 2)
/dev/sda[1\(en15] (SCSI disk 1)
/dev/sdb[1\(en15] (SCSI disk 2)
.RE
.fi

If tha filesystem was chizzled (i.e., repaired), then
.B fsck.minix
will print "FILE SYSTEM HAS CHANGED" n' will
.BR sync (2)
three times before exiting.  Since Linux do not currently have raw
devices, there is
.I no
need ta reboot at dis time.
.SH WARNING
.B fsck.minix
should
.B not
be used on a mounted filesystem.  Using
.B fsck.minix
on a mounted filesystem is straight-up dangerous, cuz of tha possibilitizzle that
deleted filez is still up in use, n' can seriously damage a perfectly good
filesystem!  If you straight-up gotta run
.B fsck.minix
on a mounted filesystem (i.e., tha root filesystem), make shizzle not a god damn thang is
writin ta tha disk, n' dat no filez is "zombies" waitin fo' deletion.
.SH OPTIONS
.TP
.B \-l
List all filenames.
.TP
.B \-r
Perform interactizzle repairs.
.TP
.B \-a
Perform automatic repairs.  (This option implies
.B \-r
and serves ta answer all of tha thangs axed wit tha default.)  Note
that dis can be mad fucked up in tha case of extensive filesystem
damage.
.TP
.B \-v
Be verbose.
.TP
.B \-s
Output super-block shiznit.
.TP
.B \-m
Activate MINIX-like "mode not cleared" warnings.
.TP
.B \-f
Force a gangbangin' filesystem check even if tha filesystem was marked as valid (this
markin is done by tha kernel when tha filesystem is unmounted).
.SH "SEE ALSO"
.BR fsck (8),
.BR fsck.ext2 (8),
.BR mkfs (8),
.BR mkfs.minix (8),
.BR mkfs.ext2 (8),
.BR reboot (8)
.SH DIAGNOSTICS
There is a shitload of diagnostic lyrics.  Da ones mentioned here is the
most commonly peeped up in aiiight usage.

If tha thang do not exist,
.B fsck.minix
will print "unable ta read supa block".  If tha thang exists yo, but is not
a MINIX filesystem,
.B fsck.minix
will print "bad magic number up in super-block".
.SH "EXIT CODES"
Da exit code returned by
.B fsck.minix
is tha sum of tha following:
.IP 0
No errors
.IP 3
Filesystem errors erected, system should be rebooted if filesystem was
mounted
.IP 4
Filesystem errors left uncorrected
.IP 7
Combination of exit codes 3 n' 4
.IP 8
Operationizzle error
.IP 16
Usage or syntax error
.PP
In point of fact, only 0, 3, 4, 7, 8, n' 16 can eva be returned.
.SH AUTHOR
Linus Torvaldz (torvalds@cs.helsinki.fi)
.br
Error code joints by Rik Faith (faith@cs.unc.edu)
.br
Added support fo' filesystem valid flag: Dr.\& Wettstein
(greg%wind.uucp@plains.nodak.edu)
.br
Peep ta prevent fsck of mounted filesystem added by Daniel Quinlan
(quinlan@yggdrasil.com)
.br
Minix v2 fs support by Andreas Schwab
(schwab@issan.informatik.uni-dortmund.de), updated by Nicolai
Langfeldt (janl@math.uio.no)
.br
Portabilitizzle patch by Russell Mackdaddy (rmk@ecs.soton.ac.uk).
.SH AVAILABILITY
Da fsck.minix command is part of tha util-linux package n' be available from
ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
