obosob/mangpages/en_GX/man8/mkfs.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.TH MKFS.MINIX 8 "June 2011" "util-linux" "System Administration"
.SH NAME
mkfs.minix \- cook up a Minix filesystem
.SH SYNOPSIS
.B mkfs.minix
.RB [ \-c | \-l
.IR filename ]
.RB [ \-n
.IR namelength ]
.RB [ \-i
.IR inodecount ]
.RB [ \-v ]
.I device
.RI [ size-in-blocks ]
.SH DESCRIPTION
.B mkfs.minix
creates a Linux MINIX filesystem on a thang (usually a gangbangin' finger-lickin' disk partition).

The
.I device
is probably of tha followin form:

.nf
.RS
/dev/hda[1\(en8] (IDE disk 1)
/dev/hdb[1\(en8] (IDE disk 2)
/dev/sda[1\(en8] (SCSI disk 1)
/dev/sdb[1\(en8] (SCSI disk 2)
.RE
.fi

The
.I size-in-blocks
parameta is tha desired size of tha file system, up in blocks.
It be present only fo' backwardz compatibility.
If omitted tha size is ghon be determined automatically.
Only block counts strictly pimped outa than 10 n' strictly less than
65536 is allowed.
.SH OPTIONS
.TP
.B \-c
Peep tha thang fo' wack blocks before bustin tha filesystem.  If any
are found, tha count is printed.
.TP
.BI \-n " namelength"
Specify tha maximum length of filenames.
Currently, tha only allowable joints is 14 n' 30.
Da default is 30.  Note dat kernels olda than 0.99p7
only accept namelength 14.
.TP
.BI \-i " inodecount"
Specify tha number of inodes fo' tha filesystem.
.TP
.BI \-l " filename"
Read tha list of wack blocks from
.IR filename .
Da file has one bad-block number per line.  Da count of wack blocks read
is printed.
.TP
.B \-1
Make a Minix version 1 filesystem.
.TP
.BR \-2 , " \-v"
Make a Minix version 2 filesystem.
.TP
.B \-3
Make a Minix version 3 filesystem.
.SH "EXIT CODES"
Da exit code returned by
.B mkfs.minix
is one of tha following:
.IP 0
No errors
.IP 8
Operationizzle error
.IP 16
Usage or syntax error
.SH "SEE ALSO"
.BR mkfs (8),
.BR fsck (8),
.BR reboot (8)
.SH AVAILABILITY
Da mkfs.minix command is part of tha util-linux package n' be available from
ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
